Dans Windows, il n’y a pas de bugs. Windows est le bug
**Quand quelqu'un de triste joue aux jeux vidéo pour oublier, on peut dire qu'il se console.
**Pourquoi les geeks doivent-ils suivre une formation incendie ?

A cause des pare-feux.
**Quel Pokemon a une mitraillette ?

Ratatatatatatatatata
**A quoi sert Internet Explorer ?

A télécharger Google Chrome.
**Quand est ce que Windows ne bug pas ?

Quand l'ordinateur est éteint.
**Que dit une mère à son fils geek quand le diner est servi ?

Alt Tab !!!
**T'as pris quoi comme résolution pour cette nouvelle année ?

1080p.
**Quelle est la meilleure heure pour écouter de la musique ?

Deezer...
**Où partent les geeks en vacances ?

Au C-Shell.
**Comment un informaticien répare sa voiture quand elle est en panne ?

Il sort de la voiture, ferme toutes les fenêtres, retourne dans la voiture, et la redémarre.
**Un homme met à jour le mot de passe de son ordinateur.
Il tape « monpenis ».
Sur l’écran, le message suivant s’affiche :
« Erreur. Trop court. »
**Comment appelle-t-on les champignons les plus moches dans Mario ?

- Les moches rooms (mushrooms)
**Quand le geek a fini de faire l’amour, il ferme Youtube.
**Comment fait un belge pour allumer un ordinateur ?

– Il lui tend un briquet.
**Windows Explorer ne répond pas.
Windows recherche une solution à ce problème.
« Recherche d’une solution au problème » ne répond pas.
Windows recherche une solution à ce problème.
**On ne dit pas : un geek tombe malade,
on dit : il attrape un virus.
**Bill Gates ferait un excellent jardinier, car Windows plante tout le temps.
**Le geek et SQL:

INSERT mon_poing
INTO ta_gueule
**Que fait un geek qui se prend pour un cosmonaute ?
Il cherche la touche espace…
**Quelle est la différence entre Windows et un virus ?
– Le virus fonctionne.
**La vie d’un Geek ne tient qu’à un fil : le câble Ethernet.
**T’es tellement geek que ta mère aurait dû faire un CTRL+Z à ta naissance.
**Que faire si un manchot ouvre une fenêtre ?
L’abattre, c’est un déviant.
**T’es tellement geek que lorsque t’as une bonne note à l’école, tu cries « je suis passé au niveau 15 ».
**Quel est le comble pour un geek ?
– Etre privé de sortie.
**Pourquoi Wine ne fonctionne-t-il jamais ?
Parce qu’il imite Windows…
**T’es tellement geek que quand tu vas chez le coiffeur tu lui demande de te CTRL + X les cheveux.
**T’es tellement geek que quand tu choisis un plat au resto, tu fais alt+TAB.
**World of Warcraft est le moyen contraceptif le plus sûr pour un geek.
**Quel est le point commun entre un geek et un vampire ?
Iles craignent tous les deux le soleil !
**Que fait un geek après avoir fais l'amour ?
il nettoie l'historique.
